<template>
  <div app>
    
  <h1>Главная страница приложения</h1>
  <p>
    Краткое содержание
Первая часть
Главы 1-3
Давным-давно  в Ла-Манче жил «один  из  тех  идальго,  чье  имущество заключается в фамильном копье, древнем щите, тощей кляче  и  борзой  собаке». Это был сухопарый, крепкий мужчина около пятидесяти лет.
С большим удовольствием он «отдавался чтению  рыцарских  романов», забывая порой о своих непосредственных обязанностях – ведении хозяйства и охоте. Он так много времени проводил за чтением, что «мозг у него стал иссыхать, так что в конце концов  он  и  вовсе потерял рассудок».
Однажды, следуя примеру героев своих любимых романов, он и сам решил «сделаться странствующим рыцарем», назвав себя Дон Кихотом, а свою старую клячу – Росинантом. Поразмыслив, он отыскал себе и даму сердца, в честь которой ему предстояло совершить немало доблестных подвигов. Ею оказалась «весьма миловидная деревенская девушка» Альдонса Лоренсо,  которую рыцарь окрестил Дульсинеей Тобосской.
				
				(function(w, n) {
					w[n] = w[n] || [];
					w[n].push({
						ownerId: 326810,
						containerId: 'adfox_knigi_640x290_2',
						params: {
							pp: 'h',
							ps: 'eizi',
							p2: 'gznz',
							pk: __clADF__.state,
						}
					});
					})(window, 'adfoxAsyncParams');
				
Не медля ни минуты, Дон Кихот отправился в дорогу. Спустя время перед его взором предстал дворец, который на поверку оказался обычной таверной. Рассказы странника развеселили постояльцев, и Дон Кихот получил еду и питье.
Героя терзала мысль, «что он еще не посвящен в рыцари». Для исполнения задуманного он выбрал хозяина таверны. На резонный вопрос о наличии у него денег Дон Кихот немало удивился: ни в  одном из романов он не прочел, что у рыцарей должны быть деньги. Сжалившись над чудаком, хозяин таверны посоветовал ему всегда при себе иметь деньги, которые могут пригодиться в любой момент.
Погонщик мулов, решив напоить своих животных, снял с водопойного корыта доспехи Дон Кихота и получил от него сильный удар копьем. Желая побыстрее избавиться от сумасшедшего постояльца, хозяин таверны посвятил его в рыцари подзатыльником и ударом шпаги в спину, после чего герой отправился навстречу приключениям.
Главы 4-6
Услышав чей-то плач, Дон Кихот увидел паренька, которого «некий дюжий сельчанин нещадно стегал ремнем, сопровождая каждый удар попреками и нравоучениями». Новоявленный рыцарь вступился за мальчика, но после его отъезда мужчина избил провинившегося пастушонка чуть не до смерти.
Вскоре Дон Кихоту самому пришлось отведать изрядную долю тумаков, когда он попытался заставить местных купцов признать Дульсинею Тобосскую самой прекрасной дамой на свете.
Домочадцы, увидев избитого и обессиленного Дон Кихота, решили, что причиной его бед стали книги, которые необходимо сжечь. Они внимательно осмотрели богатую библиотеку героя и почти всю ее уничтожили, кроме нескольких безобидных изданий.
Главы 7-20
Придя в себя, Дон Кихот предложил наивному хлебопашцу Санчо Пансе отправиться с ним в дорогу «в качестве его оруженосца». Тот, недолго думая, оседлал своего верного ослика и последовал за рыцарем.
На своем пути они повстречали ветряные мельницы, которые Дон Кихот принял за могучих великанов и решил с ними сразиться. Но, потерпев неудачу в борьбе с ними, рыцарь со своим оруженосцем был вынужден продолжить дальше путь.
Дон Кихот и Санчо Панса остановились переночевать на постоялом дворе, который рыцарь в очередной раз принял за «некий славный замок». Тем временем хозяйская дочка собралась «на  свидание  к погонщику», но в темноте наткнулась на Дон Кихота, который решил, что это дочь «владельца замка, которую он якобы сумел очаровать».
				
				(function(w, n) {
					w[n] = w[n] || [];
					w[n].push({
						ownerId: 326810,
						containerId: 'adfox_knigi_640x290_4',
						params: {
							pp: 'i',
							ps: 'eizi',
							p2: 'gzob',
							pk: __clADF__.state,
						}
					});
					})(window, 'adfoxAsyncParams');
				
Поднялся переполох, завязалась драка – рыцарю и его ни в чем не повинному оруженосцу здорово досталось на орехи.
Далее на своем пути они повстречали стадо баранов, которых Дон Кихот принял за вражеское войско. Он стал беспощадно избивать несчастных животных, но в результате сам стал жертвой пастухов, которые закидали его камнями. Глядя на грустное выражение лица своего господина, Санчо назвал его Рыцарем Печального Образа.
Однажды во время ночлега Дон Кихот и Санчо Панса услышали странные громкие звуки, которые напугали их. Они приготовились к самому худшему, но утром выяснилось, что звуки издавали обычные сукновальные молоты.
Главы 21-31
Странники вновь отправились в путь и вскоре заметили «всадника с каким-то  предметом  на  голове, сверкавшим, точно золото». Им оказался цирюльник с тазом на голове. Дон Кихот решил захватить сверкающий шлем и был очень счастлив, когда ему это удалось.
Далее путешественники освободили каторжников. В качестве благодарности они избили своего спасителя только за то, что он попросил их передать привет прекрасной Дульсинее.
Во время ночлега был похищен осел Санчо Пансы. Вор «еще до рассвета успел отъехать так далеко, что его уже невозможно было настигнуть». Но вскоре потеря была возмещена весьма щедро: Дон Кихот и его оруженосец нашли сундук с деньгами и книгой. Рыцарь взял себе книгу, а все деньги отдал Санчо Пансе.
Дон Кихот написал два письма, одно из которых предназначалось Дульсинее Тобосской, а  другое – племяннице, с просьбой прислать трех ослов, принадлежащих герою. Письма должен был доставить Санчо Панса.
Оруженосец отправился в путь, но, встретив по дороге домой цирюльника и священника, понял, что забыл взять с собой послания Дон Кихота. Тогда он принялся воспроизводить их по памяти и «наговорил невесть сколько всякой чепухи».
Односельчане решили, что ополоумевшего Дон Кихота следует вернуть в родную деревню. Они попросили Санчо передать рыцарю, что он должен возвратиться домой, поскольку того желает сама Дульсинея. Они уверили оруженосца, что оказанная им услуга позволит ему стать королем, и тот принялся реализовывать намеченный план.
Санчо Панса передал своему господину «просьбу» прекрасной Дульсинеи, на что тот ответил, что не вернется в родимый край до тех пор, пока не совершит достойных своей дамы сердца подвигов.
Тогда на помощь цирюльнику и священнику пришла девушка по имени Доротея. Она выманила Дон Кихота, представившись ему принцессой, которая нуждается в помощи благородного рыцаря. По дороге они встретили каторжника, укравшего у Санчо Пансы осла, и собственность оруженосца была возвращена хозяину.
У источника спутники увидели того самого мальчика, которого «стегал  поводьями  некий сельчанин» и за которого заступился Дон Кихот. Пастушок признался, что вмешательство рыцаря вышло ему боком, и ругал своего защитника, на чем свет стоит.
Главы 32-46
Компания решила остановиться на ночлег в постоялом дворе, где ночью Дон Кихоту привиделось нападение врагов. Он принялся размахивать мечом, проткнув сосуды с вином и напугав своего оруженосца. Односельчане оповестили всех в округе, что Дон Кихот лишился рассудка.
За время пребывания путешественников на постоялом дворе они стали свидетелями самых разнообразных житейских историй: драматических, любовных и откровенно комедийных.
Одним из посетителей таверны стал цирюльник, у которого Дон Кихот отобрал таз и водрузил себе на голову в качестве шлема. Чтобы погасить разгоравшийся конфликт, священник заплатил цирюльнику необходимую сумму.
Далее в таверну прибыли стражники. Они предоставили «указ, прямо касающийся Дон Кихота, коего Святое братство постановило задержать  за то, что он освободил каторжников». Чтобы устранить неприятности, священнику и в этот раз пришлось откупиться и напомнить, что разыскиваемый человек – сумасшедший.
Главы 47-52
Односельчане из благих намерений решили посадить Дон Кихота в самодельную клетку, чтобы в целости и сохранности довести безумца домой. Спустя время рыцарю удалось убедить своих сопровождающих в том, что он не намерен сбегать, и его пересадили на телегу.
Добравшись до родной деревни, Санчо Панса не преминул рассказать своей женушке, что вскоре станет «графом  или  же  губернатором  острова,  да  не   какого-нибудь там захудалого, а самого что ни на есть лучшего».
Тем временем «ключница и племянница Дон Кихота» принялись ухаживать за рыцарем. Священник сообщил девушке, чтобы она как «можно лучше позаботилась о дяде и чтобы они обе были начеку, а то, мол,  он  опять  убежит».
Часть вторая
Главы 1-11
Вверившись заботам ключницы и племянницы, Дон Кихот восстанавливал свое здоровье. Цирюльник и священник не навещали его в течение месяца, «чтобы не вызывать  и  не  воскрешать  в  его  памяти минувших событий». Когда же священник рискнул навестить Дон Кихота, он понял, что тот совершенно здоров. Но стоило визитеру вскользь упомянуть о рыцарстве, что стало ясно: Дон Кихот по-прежнему одержим им.
От верного оруженосца герой узнал, что вышла в свет книга «под названием Хитроумный идальго Дон Кихот Ламанчский», которая пользуется большим успехом. После этого разговора Дон Кихот решил, что нужно непременно отправляться в дорогу. Заподозрив неладное, ключница и Антония всеми силами попытались этому воспрепятствовать, но безрезультатно.
Перед тем, как отправиться в дорогу, Рыцарь Печального Образа решил получить благословение дамы сердца. Он приказал своему оруженосцу отвести его в замок Дульсинеи, но тот понятия не имел, где его искать.
Тогда Дон Кихот был вынужден признаться, что никогда не видел Дульсинею вживую и «влюбился в нее только  по слухам». Санчо чуть не признался, что и он не знает, как выглядит эта дама, но вовремя вспомнил, как «передавал» ей письма, и прикусил язык.
Оруженосцу не оставалось ничего другого, как выдать за прекрасную Дульсинею обычную крестьянку. Каково же было удивление и разочарование Дон Кихота, когда вместо обворожительной дамы он увидел неотесанную дурнушку. Последней каплей стало поведение «дамы сердца», когда она грубо обругала рыцаря и его слугу. Санчо Пансе удалось выкрутиться: он сказал, что это происки коварного колдуна. Дон Кихот удовлетворился этим объяснением, и они отправились в путь.
Главы 12-21
Во время привала Дон Кихот и Санчо заметили, как неподалеку от них расположились на отдых двое мужчин, один из которых был Рыцарем Зеркал.  Познакомившись с ним, Дон Кихот узнал его печальную историю любви.
Рыцарь Зеркал признался, что ради благосклонности своей дамы сердца он грозился одолеть «всех странствующих рыцарей Испании и даже всего мира», в том числе и знаменитого Дон Кихота. Оскорбленный такой ложью, Рыцарь Печального Образа вызвал его на поединок.
Дон Кихоту удалось одолеть противника, и вскоре он узнал, что это был не кто иной, как Самсон Карраско – автор книги о Дон Кихоте, который хотел таким образом вернуть чудака домой. Герой не сомневался, что все это проделки злого мага, и продолжил путь с верным оруженосцем.
В дороге Дон Кихот встретил благородного идальго Диего, и они вместе продолжили свое путешествие. Вскоре они заметили повозку, а  на ней – «клетку  с  двумя  свирепыми  львами». Рыцарь понял, что это – отличный шанс продемонстрировать отвагу и приказал погонщику открыть клетку. Тот повиновался, но львы так и не покинули клетку. В итоге Дон Кихот присвоил себе титул Рыцаря Львов и продолжил свой путь.
Далее странники оказались на свадьбе Китерии Прекрасной и Камачо Богатого. Внезапно на празднике появился влюбленный в девушку Басильо, заявивший, что не может жить без возлюбленной и проткнувший себя кинжалом. Юноша заявил священнику, «что  ни   за   что   не   станет исповедоваться, покуда Китерия не отдаст ему  своей  руки». Китерия согласилась, и спустя время выяснилось, что влюбленные специально все подстроили, чтобы избавиться от ненавистного Камачо.
Главы 22-41
Дон Кихот решил исследовать пещеру Монтесиноса. Его крепко обвязали веревками, и отважный рыцарь приготовился к опасному спуску. Верный Санчо просил хозяина, чтобы он не уподоблялся «бутыли, которую спускают в колодец, чтобы остудить», но его никто не слушал.
Когда веревка закончилась, исследователя пришлось поднимать наверх. Поначалу это было так легко, что все пришли «к заключению, что Дон Кихот остался в пещере». Лишь последние рывки были тяжелы, и рыцарь был доставлен на поверхность земли в обморочном состоянии. Придя в себя, он рассказал, что, очутившись на дне пещеры, стал свидетелем множества странных вещей.
Добравшись до реки Эбро, рыцарь заметил ладью. Он признался Санчо, что эта ладья «понуждает войти в нее и отправиться на помощь какому-нибудь рыцарю или же другой страждущей  знатной  особе,  которую  великое  постигло несчастье». Сев в лодку, вскоре путешественники попали «в  водоворот,  образуемый мельничными колесами». Мукомолы попытались их было спасти, но рыцарь размахивал мечом и призывал освободить благородную особу, которую они заточили в темнице. В итоге ладья была разбита в щепы, и путешественникам пришлось заплатить за нее внушительную сумму.
Оказавшись на лугах, Дон Кихот и Санчо Панса встретили герцогов, которые прочли книгу об отважном рыцаре и были преисполнены уважением к нему. Поначалу странников встретили с почетом, но вскоре стали возникать насмешки в их адрес.
Узнав, что Дульсинея Тобосская заколдована злым магом, местный чародей предложил способ избавления от заклятья. Для этого Санчо должен был получить несколько тысяч ударов плетью. Оруженосец взбунтовался, ведь для него даже «три удара плеткой все равно что три удара кинжалом». Лишь только после того, как Санчо узнал, что срок бичевания был не ограничен, а после он получит в подарок остров, он согласился.
Главы 42-59
Герцог и герцогиня, «видя,  что  шутки  их  без  малейших  колебаний принимаются за правду, вознамерились  шутить  и  дальше». Они отправили Санчо на обещанный остров в качестве губернатора, предварительно предупредив слуг, как следует себя с ним вести.
На острове с ним произошло столь много досадных казусов, что Санчо решил вернуться к своему рыцарю, в полной мере осознав, что власть – не его призвание.
Тем временем Дон Кихот стал «тяготиться тою праздною жизнью, какую  он  вел в замке». Он испросил у герцога позволения покинуть его гостеприимную обитель и вновь отправился в путь со своим верным оруженосцем. Ощутив всю прелесть дороги, рыцарь признался Санчо, что свобода – «есть одна из самых драгоценных щедрот,  которые  небо изливает на людей».
Рыцарь Печального Образа решил направиться в Барселону.
Главы 60-74
По дороге в Барселону странникам пришлось столкнуться с бандой разбойников. Они непременно лишились бы коней и всех своих денег, если бы не разбойничий предводитель – Роке Гинарт, «который не столько жесток, сколько милосерд». Узнав Дон Кихота, он не только спас его от незавидной участи, но и лично сопроводил его.
В Барселоне герой сразился с рыцарем Белой Луны и потерпел поражение. Он выяснил, что его противник был тем самым писателем, что написал о нем книгу – Самсоном Карраско. Рыцарь Белой Луны потребовал, чтобы Дон Кихот отправился домой и не покидал его в течение года, пока не окрепнет его разум.
Рыцарь последовал его совету и, оказавшись в родной деревне, решил позабыть о рыцарстве и стать пастухом. На смертном одре он понял, что глупые фантазии лишили его рассудка и отвлекли от более важных дел. Перед смертью он позвал «друзей, священника,  бакалавра  Самсона  Карраско  и  цирюльника», чтобы сообщить им о своем желании сменить имя на Алонсо Кихано. Умер он «так спокойно и так по-христиански», как ни один рыцарь из его любимых романов…

  </p>

</div>
</template>

<script>
// import messages from '../utils/messages'
// import HomeBill from '../components/HomeBill'
// import HomeCurrency from '../components/HomeCurrency'


export default {
  name:'homePage',
  data: () => ({
    loading:false,
    currency: null,
    pesentDone: 0,
    currentGoal: 0,
    bar: false
  }),
  // async mounted() {
  //   this.currency = await this.$store.dispatch('frtchCurrency')
  //   await this.$store.dispatch('getAccount')
  //   this.pesentDone = this.$store.getters.persentageFullfilment
  //   this.currentGoal = this.$store.getters.getFinancialGoalInRub
  //   this.loading = false
  // }, 
  methods: {
    async refresh() {
      this.loading = true;
      // this.currency = await this.$store.dispatch('frtchCurrency')
      this.loading = false
    },
    show_chart() {
      this.bar = !this.bar
    }


  },

  components:{ 
  // HomeBill,
  // HomeCurrency

  
  },

}
</script>

<style>

</style>




